import 'package:hive_flutter/hive_flutter.dart';

class allAskar {
  List<String> smallDo3a2 = [];
  List<String> askar2 = [
    'الحمد لله',
    'سبحان الله',
    'الله اكبر',
    'استغفر الله',
    'أستغفر الله العظيم الذي لا إله إلا هو الحي القيوم وأتوب إليه',
    'اشهد ان لا اله الا الله واشهد ان محمدا عبده ورسوله',
    'اللهم استرنا فوق الارض وتحت الارض ويوم العرض عليك',
    'اللهم اسلمت نفسي اليك ووجهت وجهي اليك وفوضت امري اليك',
    'اللهم اعنا على ذكرك وشكرك وحسن عبادتك',
    'اللهم انى اسالك علما نافعا ورزقا طيبا وعملا متقبلا',
    'اللهم انك عفو كريم تحب العفو فاعف عني',
    'اللهم صل وسلم وبارك على سيدنا محمد',
    'اللهم قنى عذابك يوم تبعث عبادك',
    'اللهم اني اسالك الهدى والتقى والعفاف والغنى',
    'ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار',
  ];
}
